xlyric/pv-router-esp32/src/main.cpp
  //démarrage file system
  Serial.println("start SPIFFS");
  logging.Set_log_init(Start_filesystem,true);
  if (!SPIFFS.begin(true)) {
    Serial.println("SPIFFS Initialization failed!");
    return;
  }

  // Vérification de la version du File System
  test_fs_version();

  // Program & FS size
  // size of the compiled program
  uint32_t program_size = ESP.getSketchSize();
  // size of the file system
  uint32_t file_system_size = SPIFFS.totalBytes();
  // used size of the file system
  uint32_t file_system_used = SPIFFS.usedBytes();
  // free size in the flash memory
  uint32_t free_size = ESP.getFlashChipSize() - program_size - file_system_size + file_system_used;
  Serial.println("Program size: " + String(program_size) + " bytes");
  Serial.println("File system size: " + String(file_system_size) + " bytes");
  Serial.println ("File system used: " + String(file_system_used) + " bytes");
  Serial.println("Free space: " + String(free_size) + " bytes");  
  
  // Initialisation de l'écran OLED
  // ESP32D1MINI_FIRMWARE : option de BUILD
  #ifdef ESP32D1MINI_FIRMWARE
    oled.init();
    oled.wait_for_wifi(0);
  #endif

  // ACTIVATION DU COOLER
  pinMode(COOLER, OUTPUT);
  digitalWrite(COOLER, HIGH);

  // Configuration du canal PWM (Pulse With Modulation)
  ledcSetup(pwmChannel, frequence, resolution);
  //ledcAttachPin(outputPin, pwmChannel); // NOSONAR

  // Gestion JOTTA/SSR2 (outputPin2)
  // Gestion RELAY3/SSR3 (outputPin3)
  #ifdef ESP32D1MINI_FIRMWARE
    pinMode(outputPin2, OUTPUT);
    pinMode(outputPin3, OUTPUT);
    //ledcAttachPin(outputPin2, pwmChannel); // NOSONAR 
    //ledcAttachPin(outputPin3, pwmChannel);  // NOSONAR
  #endif

  // Configuration de la résolution des conversions analogique-numérique (ACD)
  // Résolution ACD 12bits 
  adc1_config_width(ADC_WIDTH_BIT_12);
  adc1_config_channel_atten(ADC1_CHANNEL_0,ADC_ATTEN_DB_12);
  adc1_config_channel_atten(ADC1_CHANNEL_3, ADC_ATTEN_DB_12);
  adc1_config_channel_atten(ADC1_CHANNEL_4, ADC_ATTEN_DB_12);
  adc1_config_channel_atten(ADC1_CHANNEL_5, ADC_ATTEN_DB_12);
   

  //***********************************
  //************* Setup -  récupération du fichier de configuration
  //***********************************
  // Should load default config if run for the first time
  Serial.println(F("Loading configuration..."));
  config.loadConfiguration();

  //***********************************
  //************* Setup -  récupération des LOGS
  //***********************************
  loadlogs();

  //***********************************
  //************* Setup -  récupération de la config Wifi ou AP
  //***********************************
  if (configwifi.recup_wifi()) {
     logging.Set_log_init(Loading_wifi_configuration,true);
       AP=false; 
  } 
  else {
    Serial.println(F("mode AP please configure password before Wifi"));
  }

  //***********************************
  //************* Setup -  setup MQTT
  //***********************************
  configmqtt.loadmqtt();
  // vérification que le nom du serveur MQTT est différent de none
  if (strcmp(config.mqttserver,"none") == 0 ) {
    config.mqtt = false; 
  }
  else {
    config.mqtt = true; 
  }
  
  //***********************************
  //************* Setup -  setup FRONIUS
  //***********************************  
  configmodule.Fronius_present=false;
  configmodule.Fronius_present = loadfronius(fronius_conf);

  //***********************************
  //************* Setup -  setup ENPHASE
  //***********************************  
  configmodule.enphase_present=false;   
  loadenphase(enphase_conf);
 
  //***********************************
  //************* Setup -  sonde DALLAS 18B20 locale
  //***********************************  
  Serial.println("start 18b20");
  sensors.begin();
  // Recherche de sonde
  dallas.detect = dallaspresent();
  // detection d'incohérence entre une dallas précédement détecté et maintenant non détecté
  if (dallas.detect == false && config.dallas_present == true) {
    dallas.detect = true;  // ce qui remontera l'incohérence et la tentative de reconnexion en plus de la protection
    logging.Set_log_init("Dallas précédente non retrouvé au reboot, mise en sécurité\r\n");
    dallas.lost = true;
  }
  // inversement, si présente mais pas noté dans la conf alors on en registre
  if (dallas.detect == true && config.dallas_present == false) {
    config.dallas_present = true; 
    // on sauvegarde la conf
    config.saveConfiguration();
  }
  Serial.println("debugdallas");
  Serial.println(config.dallas_present);
  Serial.println(dallas.detect);
  Serial.println(dallas.lost);

  // Mise à jour de la résolution des conversions analogique-numérique (ACD)
  // Résolution ACD 12bits 
  adc1_config_channel_atten(ADC1_CHANNEL_0, ADC_ATTEN_DB_12);
  adc1_config_channel_atten(ADC1_CHANNEL_4, ADC_ATTEN_DB_12);
  adc1_config_channel_atten(ADC1_CHANNEL_5, ADC_ATTEN_DB_12);
  #ifdef TTGO
    pinMode(ADC_INPUT, INPUT);
  #endif
  // déclaration switch
  pinMode(RELAY1, OUTPUT);
  pinMode(RELAY2, OUTPUT);
  digitalWrite(RELAY1, HIGH); //correction bug de démarrage en GPIO 0
  digitalWrite(RELAY2, LOW);

  //***********************************
  //************* Setup - connexion Wifi
  //***********************************    
  // Affichage OLED 1
  #ifdef  ESP32D1MINI_FIRMWARE
    oled.wait_for_wifi(1);
  #endif
  // Connexion WiFi
  connect_to_wifi();
  // Affichage OLED 1
  #ifdef  ESP32D1MINI_FIRMWARE
    oled.wait_for_wifi(2);
  #endif
  
  //***********************************
  //************* Setup - mDNS
  //***********************************    
  mdns_hello(gDisplayValues.pvname);
  Serial.println(mDNS_Responder_Started);
  Serial.println(gDisplayValues.pvname);
  logging.Set_log_init(mDNS_Responder_Started,true);
  logging.Set_log_init(gDisplayValues.pvname + ".local\r\n",true);

  //***********************************
  //************* Setup - infos ESP32
  //***********************************    
  ESP32Info espInfo = getESP32Info();
  Serial.println("=== ESP32 Information ===");
  Serial.print("Chip Model: "); Serial.println(espInfo.chipModel);
  Serial.print("Chip Revision: "); Serial.println(espInfo.chipRevision);
  Serial.print("Number of CPU Cores: "); Serial.println(espInfo.chipCores);
  Serial.print("Board Name: "); Serial.println(espInfo.boardName);
  Serial.print("Chip ID: "); Serial.println(espInfo.chipID, HEX);

  //***********************************
  //************* Setup - init Affichage OLED
  //***********************************    
  #if OLED_ON == true
    Serial.println(OLEDSTART);
    // Initialising OLED   
    #ifdef TTGO
        pinMode(SWITCH,INPUT_PULLUP);
        pinMode(BUTTON_LEFT,INPUT_PULLUP);

        display.init();
        display.setRotation(1);
        
        if (config.flip) {
          display.setRotation(3);
        }

        display.fillScreen(TFT_BLACK); // Black screen fill
        display.setCursor(0, 0, 2);
        display.setTextColor(TFT_WHITE,TFT_BLACK);  display.setTextSize(1);
        display.println(BOOTING);
    #endif // TTGO
  #endif // OLED_ON

  //***********************************
  //************* Setup - NPT
  //***********************************
  ntpinit(); 

  //***********************************
  //************* Setup - Dimmer
  //***********************************  
  Dimmer_setup();

  //***********************************
  //************* Setup - vérif FS
  //***********************************   
  // vérification de la présence d'index.html
  if(!SPIFFS.exists("/index.html.gz")){
    Serial.println(SPIFFSNO);  
    logging.Set_log_init(SPIFFSNO,true);
  }

  //***********************************
  //************* Setup - Chargement config
  //***********************************   
  // vérification de la présence du fichier de configuration
  if(!SPIFFS.exists(config.filename_conf)){
    Serial.println(CONFNO);  
    logging.Set_log_init(CONFNO,true);
  }
  /// chargement des conf de minuteries
  Serial.println("Loading minuterie");
  programme.set_name("/dimmer");
  programme.loadProgramme();
  programme_marche_forcee.set_name("/marche_forcee");
  programme_relay1.set_name("/relay1");
  programme_relay1.loadProgramme();
  programme_relay2.set_name("/relay2");
  programme_relay2.loadProgramme();
  // Initialize Dimmer State 
  gDisplayValues.dimmer = 0;

  //***********************************
  //************* Setup - init Semaphore
  //***********************************   
  mutex = xSemaphoreCreateMutex();  // Création du mutex

